{
  "summary": "EtC: Programmable blockchain for smart contracts. EOAs: externally owned accounts, and contract accounts: autonomous objects controlled by smart contract code. Transactions: Transactions correspond to data packages that are signed by the private key of the issuing EOA. Gas: Resources used for transaction execution are subject to fees. Consensus: Proof of Stake. Data: Bitcoin, Ether, ERC-20, ETC-1, ECR-2, ETH-3, ECC-4, ENC-5, EBC-6, ECA-7, EACC-8, EMC-9, EAC-10, EPC-11, ECCC-12, ECHR-12.\nIn Figure, the transaction limits the amount of gas available for its execution to 2,000. The corresponding amount of Ether is then subtracted from the sender’s balance up front. The state is not stored within the blockchain, but maintained by the clients. Making all resource consumption subject to fees prevents infinite loops, which are necessary to prevent DoS attacks. The Ghost protocol in Ethereum is (Greedy Heaviest Observed Subtree) was introduced in 2013 as a way of combating the way that fast block time blockchains suffer from a high number of stale blocks. In Bitcoin, the probability of finding a block at the same time is relatively low.\nGHOST is a new policy for the selection of the main chain in the block tree. In Bitcoin, the probability of finding a block at the same time is relatively low. GHOST includes stale blocks – or Uncles – these are included in the calculation of which chain is longest or has the highest cumulative difficulty. Centralization is solved by giving block rewards to stales of 87.5% – the nephew (child of the Uncle block) also receives a reward of 12. 5% of the block reward. This encourages miners to include uncles and reduces the advantage of being closer to the network core.\nThe GHOST Protocol (Greedy Heaviest Observed SubTree) is used to reduce centralization pressure. It is a virtual computer that runs on every Ethereum node and ensures that the same code produces the same result everywhere — maintaining consensus across the network. The Ethereum Virtual Machine (EVM) is the runtime environment for executing smart contracts on the Ethereum blockchain. The algorithm will pick 1B as belonging to the main chain, and proceed to resolve the forks inside subtree(1B) This will result in the choice of blocks 0, 1B, 2C, 3D, 4B as the mainChain of the tree.\nEther is the name of the cryptocurrency for the Ethereum blockchain. Ether incentivizes the network to secure itself through proof-of-work mining. Every instruction in EVM consumes Gas. EVM is sandboxed — code runs in isolation, so it cannot access system files or network directly. The main benefit of the change will be the reduction in cost of energy associated with proof of work. This may make it more attractive for individuals to run nodes in the network, which would increase decentralization and increase securit. ount. 11/25/2025 BLOCKCHAIN TECHNOLOGY, DR. REEMA PATEL, IIIT SURAT 22 EVM • Smart Contract → EVM Bytecode.\nEthernet is a decentralization and security network. It has a Proof of Stake block time of 10 minutes 12 seconds. It was created by Vitalik Buterin and is based on the Bitcoin protocol. It is currently being developed by a group of developers based in San Francisco, California. The team is also working on a version of the protocol that will be called Ether.",
  "refined": "[Refinement failed: model requires more system memory (3.2 GiB) than is available (2.1 GiB) (status code: 500)]"
}