{
  "summary": "Blockchain technology has attracted various trustworthy and secured manner. areas like corporations, education, government, and healthcare Distributed ledger A digital system or database for storing because of its unhackable security features. In spite of common the transactions and recorded in multiple arguments about the occurrence of Blockchain technology in places . terms of security and privacy, in reality, several attacks can be Consensus A fault tolerant mechanism and way of launched against them. IEEE - 45670 Blockchain Security Attack: A Brief Survey ANITA.N VIJAYALAKSHMI. Department of Computer Science and Engineering Thiagarajar College of Engineering Madurai, India.\nBlockchain is an open, decentralized ledger that records transaction between two parties in a permanent way. It has promising features such as immutability, transparency, coinbase. consensus, non-third-party authentication, faster settlement. However, it still has security loopholes through which the disadvantages. s will lead to a health care, governments [2-7]. single point of failure and inefficiency. Due to the focus on startup, the security often paradigm and as a result Blockchain is introduced to becomes a least priority, cryptocurrency companies falls in enhance the security. This paper presents taxonomy of various attack over TABLE 1: BLOCKCHAIN KEY FEATURES AN ANCHORAGE.\nThis paper presents taxonomy of various attack over TABLE 1: BLOCKCHAIN KEY FEATURES AND ITS DESCRIPTION. It also summarized the various methodologies to resolve these attacks in the Blockchain. Key features Description Immutability Nobody can modify the distributed . ledger of Blockchain. Transparency Transactions of each public address are open to all Blockchain users in 10th ICCCNT 2019 July 6-8, 2019, IIT - Kanpur Kanpur, India IEEE - 45670 Fig 1 : (a) Traditional network and (b) Blockchain network II. RELATED WORKS privacy, confidentiality are swaged by the most powerful attacks for example, Distributed Denial of Service(DDoS)\nA 51% percentage attack occurs in to the various layers in the IoT stack. Attackers use 51% attack to reverse the deliberated the long-range attack. The introduction of the distributed trust Non-reputation, Data Provenance, and Data confidentiality model for IoT helps to avoid the launch of this attack. Some of these services such as integrity, authentication, 10th ICCCNT 2019 July 6-8, 2019, IIT - Kanpur Kanpur, India IEEE - 45670 Fig 2: Taxonomy of attack on the Blockchain correctly and hence, ballot box integrity problem occurs in Fig 3.\nZcash high computation power and can add a new block faster than protocol [7] used in the voting system which offers anonymity a legitimate miner. New block created by the attacker will of voter transactions. Decentralized trust management system be added in the long chain of the network. [4] is formed in a vehicular network against ballot stuffing 2)Collusion attack: A Collusion attacker finds a similar attack. The traffic attack is one where the adversary node tries schemes are highly cost-effective and induce less to jam the network by inducing congestion into the network processing time. and it results in the denial of service to the legitimate users.\nZero Block scheme [27] guards this the legal node list and abnormal to the illegal node list. This security model can scheme, each block must be generated and received by the detect an attack against spam transaction and avoids spam network within a max interval time. The selfish block will transaction. be rejected by an honest miner, when the selfish miner A novel architecture [30] has been proposed for efficient keeps that block as private more than the max interval. Since DistBlockNet model for IoT [32] architecture is capable the e-voting system is completely anonymous [29], of detecting DDoS/DoS attack and security threads.\nBitcoin client divides two groups of methods namely new as follows bucket and tried blocks based on IP address. New bucket ❖ Operating Domain Name Server (DNS) on contains the list of all peers and the unestablished outgoing Blockchain. connection in Bitcoin client. The tried block comprises the. list of IP address which has been already established with ❖ Using. Ethereum and. blockchain. connection by a client. An attacker may 1)Code Injection attack : An attacker exploits the change the identity of the data owner by causing a spoofing vulnerabilities in the web application and injects code to attack. 2) SQL Injection attacks: An attacker tricks the server to network security. execute the malicious queries, thus deleting or changing the database or stealing the sensitive data.\nThe aim of this attack is to proposed against Sybil attack. Subsequently, it provides modify the software execution by sending the erroneous scalable implementation and it is consistent with network data to the device. A distributed protection framework [35] infrastructure. proposed in modern power systems utilizes Blockchain security characteristics. In this framework, meter nodes have 2)Eclipse attack: An eclipse attack isolates 10th ICCCNT 2019 July 6-8, 2019, IIT - Kanpur Kanpur, India IEEE - 45670 Fig 4: DDoS attack on Blockchain JavaScript code, crypto jacking script is identified by considered a private Blockchain network.\nA tier based end-end way to restore the original data. Adversary tries to modify the data in the block and once the integrity is compromised, there is no 1) Man in the middle attack. 2) Malware attack :Malware is a software designed to 3) Replay attack: The lightweight authentication protocol seize a computer’s processing power secretly and to use it to mine the cryptocurrency. The message of the miners in the network not only affect individual user event[34] is generated with a description of time. device but also the overall network. These attacks are less Receivers check the current time and the event time when visible, more silent threats and induce false sense of the Announcement- Aggregated Packet (AGP) security.\nMalware is a major issue with network security applications. Security framework malware can be easily detected and mitigated. Energy consumption is one of the challenge most of the attack between currencies and mining process. An innovative resilient design is needed against combined application free attacks in case of Blockchain Based on Partial Homomorphic Encryption System for Ai low resource-constrained IoT devices. In 10th ICCCNT 2019 July 6-8, 2019, IIT - Kanpur Kanpur, India IEEE - 45670. For confidential support call the Samaritans on 08457 90 90 90, visit a local Samaritans branch or click here for details.\nThis paper presents taxonomy of security threats on. It provides a comprehensive survey of attack and solutions to. As a October. future scope, research methodologies and algorithms pertaining to the research areas are to be devised. The paper concludes with the Control System and Communications (SSIC) , IEEE, pp. 1-7, 2018, further research challenges in Blockchain technologies. The challenges and research directions are the presented at the end of the paper. It is based on a paper by Y. Toor, P. Muhlethaler, and A. Laouiti in IEEE Communications Surveys & Tutorials, vol. 10, no. 3, 2008.\nPirlGuard — Innovative Solution against 7285,2019. 51% Attacks’, available [online], https://medium.com/pirlguard- innovative-solution-against-51-attacks-7dd45aa1109, 2018. IOTA Cryptocurrency Users Lose $4 million in Clever Phishing Attack, [30] Kyung Kim, “Analysis of Spam Transaction on the https://www.bleepingcomputer.com’s /iota-cryptocurrency- Blockchain”, 2019. no,3.34, pp 551-553, 2018, 2019, no, 3,34.\nA survey on Mitigation: A Case Study of the I2PNetwork, 2018. Future Generation Computer Systems, 2017. Identifying key leakage of Bitcoin things: Research issues and challenges. “Distributed Blockchain-Based data Protection Framework for Modern Digital Communications andNetworks, 2019. Power Systems against cyber attacks”, IEEE Trans. Smart Gird, vol.10, no.3, pp.3162-3173, , 2018. IoTsecurity: Review, Blockchain solutions, and open challenges. Future. Generation Computer systems, 2017, and IEEE Internet of T, Vol.82,pp.395-411.\nM. Brengel, and C. Rossow, Identifying key leakage of Bitcoin things: Research issues and challenges. In International Symposium on Research in Attacks, Intrusions, and vol.6, 2019. Springer,Cham, pp. 623-643, 2018, September",
  "refined": "Title: Understanding Blockchain Security Threats and Attack Mitigation Strategies\n\nBlockchain technology is a decentralized, digital ledger that records transactions between parties in a secure and permanent manner. It offers several promising features such as immutability, transparency, faster settlement, and non-third party authentication. However, it also has potential security loopholes that can be exploited by malicious actors.\n\nKey Features of Blockchain:\n1. **Immutability**: Once data is recorded on the blockchain, it cannot be altered or deleted. This ensures the integrity of the system.\n2. **Transparency**: All transactions are visible to all participants in the network, promoting accountability and trust.\n3. **Consensus Mechanism**: A mechanism that ensures all nodes agree on the validity of transactions, preventing fraud and double-spending.\n\nSecurity Threats:\n1. **51% Attack**: An attacker controls more than half of the network's computing power to manipulate the system. This can lead to reversing transactions or creating new blocks faster than the protocol allows.\n2. **Collusion Attack**: Attackers collaborate to deceitfully influence the network, often resulting in denial-of-service attacks or fraudulent transactions.\n3. **Code Injection and SQL Injection Attacks**: Malicious code is injected into web applications to steal sensitive data or manipulate system behavior.\n4. **Eclipse Attack**: An attacker isolates a node from the rest of the network, potentially compromising its security.\n5. **Man-in-the-Middle Attack**: An attacker intercepts and alters transactions between parties.\n6. **Malware Attacks**: Malicious software designed to seize a computer's processing power for cryptocurrency mining without the user's knowledge.\n7. **Replay Attack**: Attacker reuses valid messages to gain unauthorized access or manipulate system behavior.\n\nMitigation Strategies:\n1. Implementing robust consensus mechanisms and network architectures can help prevent attacks like 51% attacks and eclipse attacks.\n2. Strong security protocols, such as two-factor authentication, can help protect against code injection and SQL injection attacks.\n3. Regularly updating software and using trusted sources can help mitigate man-in-the-middle attacks and malware attacks.\n4. Implementing cryptographic techniques and hashing algorithms can help prevent replay attacks.\n\nFuture Research Directions:\n1. Developing scalable, efficient, and secure blockchain systems for resource-constrained IoT devices is a significant challenge.\n2. Privacy preservation in blockchain networks is another important research area, particularly in light of growing concerns about user data protection.\n3. Exploring the potential of hybrid blockchain models that combine public and private blockchains could offer improved security and scalability.\n4. Continuous research and development are needed to address emerging threats and adapt to changing cybersecurity landscapes."
}